load_test.yml
config:
    payload:
    environments:
        development:
            target: 'http://localhost:8010'
            phases:
                - duration: 30
                  arrivalRate: 100
                  rampTo: 50
            defaults:
                headers:
                    x-api-key: "6qtCfJYiQXMwaGXxgHFPMLFoIjcFlvuUJgBrQIrY"
            variables:
                page:
                    - "1"
                    - "2"
                limit:
                    - "10"
                    - "20"
                    - "30"
scenarios:
    - flow:
        - get:
            url: "/health"
        - get:
            url: "/rides?page={{ page }}&limit={{ limit }}"
        - post:
            url: "/rides"
            json:
                start_lat: "10.90"
                start_long: "-76.89"
                end_lat: "88.23"
                end_long: "178.89"
                rider_name: "load test rider"
                driver_name": "load test driver"
                driver_vehicle: "load test vehicle"
        - get:
            url: "/rides/{{ rideID }}"